{"docstore/data":{"0af95115-6b1d-4365-92cc-26ca3ff4648c":{"indexId":"0af95115-6b1d-4365-92cc-26ca3ff4648c","nodesDict":{"c57a61c4-8662-4a88-a40c-6090d1cdfc5b":{"id_":"c57a61c4-8662-4a88-a40c-6090d1cdfc5b","metadata":{"page_number":1,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_1","metadata":{"page_number":1,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"xvnShQPb1JncfEdHdpHzMrlyCA4V2PDJ7hlUTaMNh0s="}},"text":"Vision and Purpose: Ittsy’s vision is to help its customers grow their businesses by leveraging its\n\nservices. From vision to life,one idea at a time. Our Service Offerings:\n\nIttsy offers the following services:\n\n1. Data Integration\n\n2. Solution Architecture\n\n3. AI & Gen AI\n\n4. SaaS (Software as a Service)\n\n5. API Integration\n\nSolution Architecture: Build a solution that meets your design requirements, secure and scalable\n\nenough to meet the evolving needs. Saas: Utilize the power of the internet to unleash your software for the whole world to use. Data/API Integration: No matter the source of your data, we can seamlessly integrate it\n\nanywhere. Our Promise: We take great pride in delivering only the highest quality solutions tailored to our\n\nclients requirements\n\nWhich solution is right for you? We take your ideas and transform them into pathways that pave the way for the expansion of\n\nyour business. Contact an Ittsy professional to go through your requirements and chalk out a\n\nplan.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"3VY42R4G+oSDEEoE3h34L6C/52Gh4ePnuqUtf9MyhYE="},"b7a9ddb6-81b3-418a-a948-9e218ad64138":{"id_":"b7a9ddb6-81b3-418a-a948-9e218ad64138","metadata":{"page_number":2,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_2","metadata":{"page_number":2,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"BvbIRaG+yazb7hIGCsx2NrfdtLf7iHqXgm1+QqmB+Og="}},"text":"Details about AI & GEN AI:\n\nAI and Gen AI have paved the way for Artificial Business Intelligence (ABI), driving business\n\ninsights and growth. While AI has existed for years, Gen AI has revolutionized the field. We\n\ncustomized Artificial Business Intelligence and machine learning solutions. Beneficiaries of AI & Gen AI are:\n\nBusiness Users\n\nExecutive Management Team\n\nBusiness Managers\n\nData Analysts\n\nHere is how Business Managers can get benefits of AI & Gen AI\n\nBusiness Users can interact with the data and other contents to conduct quality assurance and\n\ntesting and help improve functionality and overall user experience. Ittsy can assist you to make the most out of your business in a cost-effective and most efficient\n\nway through the use of this technology combo. Connect your internal resources regardless of\n\nthe resource type and get answers quickly, interactively, and on-demand. We can scan hundreds of thousands of documents within subseconds or mine data from any of\n\nyour datastore and respond to your questions about the content without compromising security. Here is how Executive Management Team can benefit from AI/Gen AI\n\nMembers of the Executive Teams can get business insights from the palm of their hands\n\nwhether they are chairing a meeting in the office or they are traveling for a business trip outside.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"fE2yYwTlFb6oVQgLAx7c+eC2B826kLuxnXyws2axyDg="},"bddb2fbc-cecc-438e-8c52-ed02c55a67bb":{"id_":"bddb2fbc-cecc-438e-8c52-ed02c55a67bb","metadata":{"page_number":3,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_3","metadata":{"page_number":3,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"UNKRbLYggcNx2Yd+cVqQqHcg396pB2pcVAgxk+3o7VU="}},"text":"Here is how Business Managers can benefit from AI/Gen AI\n\nBusiness Managers can focus on what they do the best: grow business. They don’t need to be\n\ntechnical. They can simply ask questions in plain English about any of the business domains\n\nthey are leading and get answers quickly to move on with their business objectives and\n\npriorities. Here is how Data Analysts cana benefit from AI/Gen AI\n\nData Analysts can slice and dice the data to identify trends and patterns without writing any\n\npiece of code. Solution Architecture:\n\nIn the Solution Architecture space, this is how we will approach our solutioning. Regardless of the type of data (be it structured, semi-structured or unstructured, Big Data or\n\ntraditional data) we will Review, Rebuild or build from scratch a solution that meets your design\n\nrequirements, secure and scalable enough to meet the evolving needs. We will have meetings\n\none on one with subject matter experts or group discussions to understand the business goals\n\nand requirements that the technology solution needs to address. Design high-level structure, components, modules, interfaces, and data flows to ensure that the\n\nsolution aligns with the organization's goals and technical standards. With your own technology stack or let Ittsys professionals recommend the appropriate\n\ntechnologies, frameworks and tools that best fit the requirements of the solution. Ittsy professionals will create detailed technical specifications, architecture diagrams, and\n\ndocumentation that outline the design and implementation details of the solution which will serve\n\nas a guide for developers and other team members. Ittsy will also ensure that the solution meets quality standards, performance requirements, and\n\ncompliance regulations. Ittsy will assess and mitigate risks associated with the solution, such as technical challenges,\n\nsecurity vulnerabilities, and scalability issues and proactively identify potential risks and develop\n\nstrategies to address them. Engage/Re-engage Ittsy professionals to stay up-to-date on emerging technologies, industry\n\ntrends, and best practices to continuously improve the architecture and design of solutions.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"vc2Jp7n1diwHBKYAp5x7Tf/zZRRw9rmjUB1qsRhL6OM="},"fba17f84-a2bc-42f6-ad65-49809a2fa5e9":{"id_":"fba17f84-a2bc-42f6-ad65-49809a2fa5e9","metadata":{"page_number":4,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_4","metadata":{"page_number":4,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"Y8xu8C0/ITcWbfkSGyPhRfRtrlcK+hzuVOZDdfoEiPc="}},"text":"SaaS:\n\nSaaS or Software as a Service is a cloud-based model that offers access to data and reports\n\nonline, with no upfront costs for software, hardware, maintenance, or upgrades. If you are\n\nlooking to reduce IT support or quickly deploy applications and scale up or down its resources\n\nso that you can focus more on your core business functions, then Ittsy can help you achieve\n\nthat goal. You just describe your problem and critical business objectives, we will lay out the plan and\n\nexecute it for you. Worry free support available 24/7 as well. Data Integration Service:\n\nData integration involves collecting data from multiple sources and loading it into target\n\nsystems. A clear definition of target systems is essential for accurate business logic processing. Ittsy has the expertise and experience in any leading data integration platforms but our product\n\nof reliable choice and recommendation would be Talend Data Integration platform. It offers a\n\nrobust suite of tools to connect, access, and transform both standard and Big Data in\n\nmulti-cloud and on-premises environments. More than 1000 connectors and components allow\n\nintegration with virtually any data source. Other major data integration tools we provide solutions\n\non are Informatica Power Center and IBM Infosphere also known as Datastage. A good integration strategy is to explicitly define your target systems as the business logic\n\nprocessing may depend on it. API Integration Service:\n\nIttsy offers API Integration services as APIs are crucial nowadays, acting as middleware to\n\nseparate frontend and backend. They enable systems to interact with data. Ittsy can develop\n\nREST or SOAP APIs for integration with your systems which could be either on of these\n\nSalesforce CRM\n\nMicrosoft CRM\n\nWorkforce ADP\n\nSAP Succcessfactor, Business Warehouse or any ecosystem","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"V2PIzynN1YmY+guRfJNjncViILtTTxl2u8a+uafCBUc="},"f724b702-f86a-4dec-b21d-add55c24bdb6":{"id_":"f724b702-f86a-4dec-b21d-add55c24bdb6","metadata":{"page_number":5,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_5","metadata":{"page_number":5,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"px7qOoCN0BL2c0sUoH4qtEPW3cCl5FzI5UfOkkzgzV0="}},"text":"Oracle ERP\n\nWorkday HR System\n\nAny custom software systems you may have\n\nProduct Offerings:\n\nWe offer custom built AI & GenAI products. Please reach out for more details and pricing. About Ittsy Systems as a Company:\n\nIttsy Systems is a technology solution provider specializing in customized software design and\n\ndevelopment services. Our primary offerings include Data Integration, Solution Architecture, and\n\nAI, with a focus on Generative AI solutions. The team at Ittsy consists of seasoned professionals with over two decades of experience in the\n\nServices Industry, complemented by fresh university graduates who introduce emerging\n\ntechnologies to create innovative solutions tailored to customer needs. Ittsy Systems is committed to delivering effective and scalable solutions, emphasizing customer\n\nsupport during and after delivery. We offer both project-based and product-based solutions. Continuously evolving, Ittsy aims to build excellent customer relationships through\n\ncommunication, collaboration, and innovation, expanding its services to meet diverse client\n\nrequirements. Privacy Policy:\n\nThis Privacy Policy outlines how we collect, use, and protect your personal information when\n\nyou visit our website. By using our website, you agree to the terms outlined in this policy.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"Xt/x0rNPX91PnUHCmgfKIR9VqnS7MBEDJSsiaBo2iTY="},"e5055298-e45b-4c4b-8bf4-e4cd7608f6dd":{"id_":"e5055298-e45b-4c4b-8bf4-e4cd7608f6dd","metadata":{"page_number":6,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_6","metadata":{"page_number":6,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"TKxJtn0yjcPmTbV+aY2n/gF5nGDLK6L5/ztj0dam7V4="}},"text":"Information We Collect as part of the Privacy policy are:\n\nPersonal Information: When you interact with our website, we may collect personal information\n\nsuch as your name, email address, and contact details. This information is collected with your\n\nconsent and used to provide you with the requested services. Usage Data: We may also collect non-personal information about your interactions with our\n\nwebsite, including your IP address, browser type, and device information. This data is used to\n\nanalyze website performance and improve user experience. How We Use Your Information that we collect:\n\nWe use the information collected to personalize your experience on our website, respond to\n\ninquiries, and provide you with relevant information and updates. Your personal information may\n\nalso be used for marketing and promotional purposes, such as sending newsletters or\n\npromotional offers. You have the option to opt out of receiving marketing communications at any\n\ntime. Data Security:\n\nWe are committed to protecting your personal information and have implemented security\n\nmeasures to safeguard your data from unauthorized access, disclosure, or misuse. Third-Party Services:\n\nWe may use third-party services and tools on our website that collect data for analytics,\n\nadvertising, or social media integration. These third-party services are governed by their own\n\nprivacy policies and terms of service.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"/cjVm0vouIWXK7ytCJGQnvSoUYrQ3APT/5xVkMXMrH4="},"a046f80e-5974-4949-b6b5-ec9cc0b3b4f8":{"id_":"a046f80e-5974-4949-b6b5-ec9cc0b3b4f8","metadata":{"page_number":7,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_7","metadata":{"page_number":7,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"9IafVDgbpNRPGI2k7Cwp1lL/KIrretoYxXRuIk/GTLc="}},"text":"Your Rights on Privacy Policy:\n\nYou have the right to access, update, or delete your personal information stored on our website. If you have any questions or requests regarding your data, please contact us at info@ittsy.co\n\nChanges to the Privacy Policy:\n\nWe reserve the right to update this Privacy Policy to reflect changes in our data practices or\n\nlegal requirements. We recommend reviewing this page periodically for any updates. If you have any questions or concerns about our Privacy Policy, please contact us at\n\ninfo@ittsy.co\n\nIttsy’s Cookie Policy:\n\nThis Cookie Policy explains how our website uses cookies to enhance user experience, analyze\n\nwebsite traffic, and personalize content. By using our website, you consent to the use of cookies\n\nin accordance with this policy. What are Cookies? Cookies are small text files that are stored on your device when you visit a website. They are\n\nwidely used to make websites work more efficiently and provide information to website owners. Types of Cookies We Use:\n\nEssential Cookies: These cookies are necessary for the website to function properly. They\n\nenable core functionalities such as page navigation and access to secure areas of the website. Analytical Cookies: These cookies help us analyze website traffic and track user interactions to\n\nimprove our website performance and user experience. Advertising Cookies: These cookies are used to deliver personalized advertisements based on\n\nyour browsing behavior and interests.","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"PB7sSsm9VTBR+KCz6hLlpqSRsfkV/xhtvuglsOumYp4="},"6b01593f-74e3-4711-8c5d-50a3892b4f7d":{"id_":"6b01593f-74e3-4711-8c5d-50a3892b4f7d","metadata":{"page_number":8,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_8","metadata":{"page_number":8,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"ZY1CtITHM4Bdz9wWpP7WNa0fzXXmDGGPrzjAQyRmYGc="}},"text":"Managing Cookies:\n\nYou can control and manage cookies in your browser settings. Most web browsers allow you to\n\nblock or delete cookies, or be notified when a cookie is being placed on your device. Please\n\nnote that blocking cookies may affect the functionality of the website. Third-Party Cookies:\n\nWe may use third-party services that use cookies to provide analytics, advertising, and social\n\nmedia features. These third-party cookies are subject to the respective privacy policies of the\n\nservice providers. Changes to the Cookie Policy:\n\nWe reserve the right to update this Cookie Policy to reflect changes in our cookie practices or\n\nlegal requirements. We recommend checking this page periodically for any updates. Contact Us on Cookie Policy:\n\nIf you have any questions or concerns about our Cookie Policy, please contact us at\n\ninfo@ittsy.co\n\nContact on General Inquiries:\n\nYou can contact us at info@ittsy.co or use our contact form below to get in touch with us or any\n\nquestion you may have about Ittsy. We will respond to your inquiry as soon as possible. Customers we have served or offered our services To:\n\nIttsy professionals have extensive experience in providing services both in private and public\n\nsectors across North America. Please reach out for more details through the Contact form\n\navailable on our website or send us email at info@ittsy.co. Can we provide a List of Customers we have served? Yes, we can provide a list of customers\n\nwe have served. Please reach out to enquire further via info@ittsy.co. Ittsy Office Address:","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"dQpubRx7RYbNwy5ecIWrvcbxbl2aZtIxaUDVaHTjKLc="},"f77886b4-9c0e-4f5f-9732-3631e96e8e8d":{"id_":"f77886b4-9c0e-4f5f-9732-3631e96e8e8d","metadata":{"page_number":9,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"excludedEmbedMetadataKeys":[],"excludedLlmMetadataKeys":[],"relationships":{"SOURCE":{"nodeId":"./data/data.pdf_9","metadata":{"page_number":9,"total_pages":9,"file_path":"C:\\Users\\itteb\\Documents\\coding\\projects\\langchain-venv\\langchain-nextjs-template\\data\\data.pdf","file_name":"data.pdf"},"hash":"H+RBvGVqRAjscuR6fgStk6iIaIbDAJdPXTGM5tDfoZc="}},"text":"You can either reach out to us via contact page on our website or visit our office which is located\n\nat:\n\n450 Bronte Street South, Unit # 215\n\nMilton, ON L9T 8T2\n\nPhone: 647-677-4937\n\nWebsite: https://ittsy.co\n\nBoard Members:\n\nCEO & CIO:\n\nTanveer Gilani\n\n647 880 2786\n\ntgilani@Ittsy.co\n\nDirector Operations:\n\nItteba Gilani\n\n647 677 4937\n\nIttebag@Ittsy.co\n\nDirector Marketing:\n\nSufyan Siddiqui\n\n437 255 2104\n\nSufyanS@Ittsy.co","textTemplate":"","metadataSeparator":"\n","type":"TEXT","hash":"O2MweYvbP0x+UL8RP681I0YcyUZ6i+jzLE2z2OYL27w="}},"type":"simple_dict"}}}